       01 INPUT-MSG.
        02 IN-LL PIC S9(4) USAGE COMP-5.
        02 IN-ZZ PIC S9(4) USAGE COMP-5.
        02 IN-TRANCDE PIC X(10) USAGE DISPLAY.
        02 IN-COMMAND PIC X(8) USAGE DISPLAY.
        02 IN-RECORD.
         05 IN-LAST-NAME PIC X(10) USAGE DISPLAY.
         05 IN-FIRST-NAME PIC X(10) USAGE DISPLAY.
         05 IN-EXTENSION PIC X(10) USAGE DISPLAY.
         05 IN-ZIP-CODE PIC X(7) USAGE DISPLAY.
